Repository: whiterabbit74/images_minifier
Catalog: Sources/PicsMinifierApp/Resources/*.lproj/Localizable.strings
Languages: ar, bn, hi, ru, ur

source: Optimizer
ar: المحسن
bn: অপ্টিমাইজার
hi: ऑप्टिमाइज़र
ru: Оптимизатор
ur: آپٹیمائزر

source: Statistics
ar: الإحصائيات
bn: পরিসংখ্যান
hi: सांख्यिकी
ru: Статистика
ur: اعداد و شمار

source: Settings
ar: الإعدادات
bn: সেটিংস
hi: सेटिंग्स
ru: Настройки
ur: سیٹنگز

source: GENERAL
ar: عام
bn: সাধারণ
hi: सामान्य
ru: ОБЩИЕ
ur: عمومی

source: INTERFACE
ar: الواجهة
bn: ইন্টারফেস
hi: इंटरफ़ेस
ru: ИНТЕРФЕЙС
ur: انٹرفیس

source: Launch at Login
ar: التشغيل عند تسجيل الدخول
bn: লগইন করার সময় চালু করুন
hi: लॉगिन पर लॉन्च करें
ru: Запускать при входе
ur: لاگ ان پر لانچ کریں

source: Notify on Completion
ar: تنبيه عند الانتهاء
bn: সম্পন্ন হলে বিজ্ঞপ্তি দিন
hi: पूरा होने पर सूचित करें
ru: Уведомить о завершении
ur: مکمل ہونے پر مطلع کریں

source: Theme
ar: السمة
bn: থিম
hi: थीम
ru: Тема
ur: تھیم

source: System
ar: النظام
bn: সিস্টেম
hi: सिस्टम
ru: Системная
ur: سسٹم

source: Dark
ar: داكن
bn: ডার্ক
hi: डार्क
ru: Темная
ur: ڈارک

source: Light
ar: فاتح
bn: লাইট
hi: लाइट
ru: Светлая
ur: لائٹ

source: App Icon
ar: أيقونة التطبيق
bn: অ্যাপ আইকন
hi: ऐप आइकन
ru: Иконка приложения
ur: ایپ آئیکن

source: Dock
ar: الدوك
bn: ডক
hi: डॉक
ru: Dock-панель
ur: ڈاک

source: Menu Bar
ar: شريط القائمة
bn: মেনু বার
hi: मेनू बार
ru: Строка меню
ur: مینو بار

source: Both
ar: كلاهما
bn: উভয়
hi: दोनों
ru: Везде
ur: دونوں

source: Reset All
ar: إعادة ضبط الكل
bn: সব রিসেট করুন
hi: सब कुछ रीसेट करें
ru: Сбросить всё
ur: سب ری سیٹ کریں

source: PRESETS
ar: الإعدادات المسبقة
bn: প্রিসেট
hi: प्रीसेट्स
ru: ПРЕСЕТЫ
ur: پری سیٹس

source: Base Preset
ar: الإعداد المسبق الأساسي
bn: বেস প্রিসেট
hi: बेस प्रीसेट
ru: Базовый пресет
ur: بنیادی پری سیٹ

source: My Presets
ar: إعداداتي المسبقة
bn: আমার প্রিসেট
hi: मेरे प्रीसेट्स
ru: Мои пресеты
ur: میرے پری سیٹس

source: Save Preset
ar: حفظ الإعداد المسبق
bn: প্রিসেট সেভ করুন
hi: प्रीसेट सहेजें
ru: Сохранить пресет
ur: پری سیٹ محفوظ کریں

source: Save current configuration as:
ar: حفظ التكوين الحالي باسم:
bn: বর্তমান কনফিগারেশন এভাবে সেভ করুন:
hi: वर्तमान कॉन्फ़िगरेशन को इस रूप में सहेजें:
ru: Сохранить текущую конфигурацию как:
ur: موجودہ کنفیگریشن کو اس طرح محفوظ کریں:

source: My Custom Preset
ar: إعدادي المسبق المخصص
bn: আমার কাস্টম প্রিসেট
hi: मेरा कस्टम प्रीसेट
ru: Мой пресет
ur: میرا کسٹم پری سیٹ

source: Cancel
ar: إلغاء
bn: বাতিল
hi: रद्द करें
ru: Отмена
ur: منسوخ کریں

source: Save
ar: حفظ
bn: সেভ
hi: सहेजें
ru: Сохранить
ur: محفوظ کریں

source: Save current settings
ar: حفظ الإعدادات الحالية
bn: বর্তমান সেটিংস সেভ করুন
hi: वर्तमान सेटिंग्स सहेजें
ru: Сохранить текущие настройки
ur: موجودہ سیٹنگز محفوظ کریں

source: Balanced (recommended) is the best mix of size and quality. Quality prioritizes details. Saving aggressively reduces size.
ar: متوازن (موصى به) هو أفضل مزيج بين الحجم والجودة. الجودة تعطي الأولوية للتفاصيل. التوفير القوي يقلل الحجم بشكل كبير.
bn: ভারসাম্যপূর্ণ (প্রস্তাবিত) হলো আকার এবং গুণমানের সেরা মিশ্রণ। গুণমান বিশদকে অগ্রাধিকার দেয়। আগ্রাসীভাবে সেভ করা আকার কমিয়ে দেয়।
hi: संतुलित (अनुशंसित) आकार और गुणवत्ता का सबसे अच्छा मिश्रण है। गुणवत्ता विवरणों को प्राथमिकता देती है। आक्रामक रूप से सहेजना आकार को कम करता है।
ru: Сбалансированный (рекомендуется) — лучшее сочетание размера и качества. Качество сохраняет детали. Экономия агрессивно уменьшает размер.
ur: متوازن (تجویز کردہ) سائز اور معیار کا بہترین امتزاج ہے۔ معیار تفصیلات کو ترجیح دیتا ہے۔ جارحانہ بچت سائز کو کم کرتی ہے۔

source: Controls clarity. 80-85% is the 'sweet spot'—visually identical to original but much smaller. Go lower (60-70%) only if file size is critical.
ar: يتحكم في الوضوح. 80-85%% هي النسبة المثالية - تماثل الأصل بصرياً ولكن بحجم أصغر بكثير. خفضها لـ 60-70%% فقط إذا كان حجم الملف بالغ الأهمية.
bn: স্পষ্টতা নিয়ন্ত্রণ করে। ৮০-৮৫%% হলো 'সুইট স্পট'—দৃশ্যত আসলের মতো কিন্তু অনেক ছোট। কেবল ফাইলের আকার গুরুত্বপূর্ণ হলেই কম (৬০-৭০%%) করুন।
hi: स्पष्टता को नियंत्रित करता है। 80-85% 'स्वीट स्पॉट' है—मूल के समान लेकिन बहुत छोटा। केवल तभी कम (60-70%) करें यदि फ़ाइल का आकार महत्वपूर्ण हो।
ru: Управляет четкостью. 80-85% — золотая середина: визуально неотличимо от оригинала, но намного меньше. Используйте меньше (60-70%), только если размер критичен.
ur: وضاحت کو کنٹرول کرتا ہے۔ 80-85% بہترین پوائنٹ ہے—دیکھنے میں اصل جیسا لیکن سائز میں بہت چھوٹا ہے۔ صرف اس صورت میں 60-70% تک کم کریں اگر فائل کا سائز انتہائی اہم ہو۔

source: How hard the CPU works to find patterns. Level 3 is fast. Level 9 tries everything to squeeze out bytes (can be very slow). No quality is lost.
ar: مدى جهد المعالج في البحث عن الأنماط. المستوى 3 سريع. المستوى 9 يحاول بكل السبل لتقليل الحجم (قد يكون بطيئاً جداً). لا تُفقد الجودة.
bn: প্যাটার্ন খোঁজার জন্য CPU কতটা কঠোর পরিশ্রম করে। লেভেল ৩ দ্রুত। লেভেল ৯ সবকিছু চেষ্টা করে বাইট বের করার জন্য (খুব ধীর হতে পারে)। কোনো গুণমান হারায় না।
hi: पैटर्न खोजने के लिए सीपीयू कितनी मेहनत करता है। लेवल 3 तेज़ है। लेवल 9 बाइट्स को निचोड़ने के लिए सब कुछ आज़माता है (बहुत धीमा हो सकता है)। गुणवत्ता में कोई कमी नहीं होती।
ru: Насколько сильно процессор ищет паттерны. Уровень 3 — быстро. Уровень 9 пробует всё, чтобы выжать байты (может быть очень медленно). Качество не теряется.
ur: سی پی یو پیٹرن تلاش کرنے کے لیے کتنی محنت کرتا ہے۔ لیول 3 تیز ہے۔ لیول 9 بائٹس کو نچوڑنے کے لیے سب کچھ آزماتا ہے (بہت سست ہو سکتا ہے)۔ معیار میں کوئی کمی نہیں آتی۔

source: Modern format quality. Lower numbers (20-30) are excellent. Higher (50+) keep more noise/grain but produce larger files.
ar: جودة التنسيق الحديثة. الأرقام المنخفضة (20-30) ممتازة. الأرقام الأعلى (50+) تحافظ على ضوضاء أكثر ولكن تنتج ملفات أكبر.
bn: আধুনিক ফরম্যাট গুণমান। কম সংখ্যা (২০-৩০) চমৎকার। উচ্চ (৫০+) বেশি নয়েজ/গ্রেইন রাখে তবে বড় ফাইল তৈরি করে।
hi: आधुनिक प्रारूप गुणवत्ता। कम संख्या (20-30) उत्कृष्ट हैं। उच्च (50+) अधिक शोर/ग्रेन रखते हैं लेकिन बड़ी फ़ाइलें उत्पन्न करते हैं।
ru: Качество современного формата. Низкие значения (20-30) — отличные. Высокие (50+) сохраняют больше шума/зернистости, но файлы будут больше.
ur: جدید فارمیٹ کوالٹی۔ کم نمبر (20-30) بہترین ہیں۔ زیادہ (50+) شور/گرین زیادہ رکھتے ہیں لیکن بڑی فائلیں بناتے ہیں۔

source: Encoding effort (0-10). Speed 0 is painfully slow but creates the smallest files. Speed 6+ is instant. Speed 4 is a good balance.
ar: جهد الترميز (0-10). السرعة 0 بطيئة جداً ولكنها تنتج أصغر الملفات. السرعة 6+ فورية. السرعة 4 توازن جيد.
bn: এনকোডিং প্রচেষ্টা (০-১০)। গতি ০ অত্যন্ত ধীর কিন্তু ক্ষুদ্রতম ফাইল তৈরি করে। গতি ৬+ তাৎক্ষণিক। গতি ৪ একটি ভালো ভারসাম্য।
hi: एन्कोडिंग प्रयास (0-10)। गति 0 बहुत धीमी है लेकिन सबसे छोटी फ़ाइलें बनाती है। गति 6+ तत्काल है। गति 4 एक अच्छा संतुलन है।
ru: Усилия кодирования (0-10). Скорость 0 — мучительно медленно, но файлы минимальны. Скорость 6+ — мгновенно. Скорость 4 — отличный баланс.
ur: انکوڈنگ کی کوشش (0-10)۔ رفتار 0 بہت سست ہے لیکن سب سے چھوٹی فائلیں بناتی ہے۔ رفتار 6+ فوری ہے۔ رفتار 4 ایک اچھا توازن ہے۔

source: Lossy (Gifsicle) is magic for GIFs—it can reduce size by 70% by slightly simplifying colors. Lossless keeps every pixel but stays huge.
ar: فقدان البيانات (Gifsicle) سحري لصور GIF - يمكنه تقليل الحجم بنسبة 70%% بتبسيط الألوان قليلاً. عدم الفقدان يحافظ على كل بكسل لكن الحجم يبقى كبيراً.
bn: লসি (Gifsicle) জিআইএফ-এর জন্য জাদুকরী—এটি রং কিছুটা সহজ করে আকার ৭০% পর্যন্ত কমাতে পারে। লসলেস প্রতিটি পিক্সেল রাখে কিন্তু বড় থেকে যায়।
hi: लॉसी (Gifsicle) GIF के लिए जादू है—यह रंगों को थोड़ा सरल बनाकर आकार को 70% तक कम कर सकता है। लॉसलेस हर पिक्सेल को रखता है लेकिन बड़ा रहता है।
ru: Lossy (Gifsicle) — магия для GIF: уменьшает размер на 70%, слегка упрощая цвета. Lossless сохраняет каждый пиксель, но размер остается огромным.
ur: لوسی (Gifsicle) GIFs کے لیے جادو ہے—یہ رنگوں کو تھوڑا سادہ کر کے سائز کو 70% تک کم کر سکتا ہے۔ لیس لیس ہر پکسل کو رکھتا ہے لیکن سائز بڑا رہتا ہے۔

source: Hover over settings for details.
ar: مرر الفأرة فوق الإعدادات للتفاصيل.
bn: বিস্তারিত জানার জন্য সেটিংসের ওপর মাউস রাখুন।
hi: विवरण के लिए सेटिंग्स पर होवर करें।
ru: Наведите на настройки для подробностей.
ur: تفصیلات کے لیے سیٹنگز پر ماؤس لائیں۔

source: JPEG Quality
ar: جودة JPEG
bn: JPEG গুণমান
hi: JPEG गुणवत्ता
ru: Качество JPEG
ur: JPEG کوالٹی

source: PNG Safe
ar: PNG آمن
bn: PNG সেফ
hi: PNG सुरक्षित
ru: Сжатие PNG
ur: PNG محفوظ

source: AVIF Quality
ar: جودة AVIF
bn: AVIF গুণমান
hi: AVIF गुणवत्ता
ru: Качество AVIF
ur: AVIF کوالٹی

source: AVIF Speed
ar: سرعة AVIF
bn: AVIF গতি
hi: AVIF गति
ru: Скорость AVIF
ur: AVIF رفتار

source: GIF Mode
ar: وضع GIF
bn: GIF মোড
hi: GIF मोड
ru: Режим GIF
ur: GIF موڈ

source: Lossy (Gifsicle)
ar: فقداني (Gifsicle)
bn: লসি (Gifsicle)
hi: लॉसी (Gifsicle)
ru: С потерями (Gifsicle)
ur: لوسی (Gifsicle)

source: Lossless
ar: غير فقداني
bn: লসলেস
hi: लॉसलेस
ru: Без потерь
ur: لیس لیس

source: RESIZE
ar: تغيير الحجم
bn: রিসাইজ
hi: आकार बदलें
ru: ИЗМЕНЕНИЕ РАЗМЕРА
ur: سائز تبدیل کریں

source: Resize Images
ar: تغيير حجم الصور
bn: ছবির আকার পরিবর্তন
hi: छवियों का आकार बदलें
ru: Изменять размер
ur: تصویروں کا سائز بدلیں

source: Target Size
ar: الحجم المستهدف
bn: লক্ষ্য আকার
hi: लक्ष्य आकार
ru: Целевой размер
ur: ہدف سائز

source: Px
ar: بكسل
ru: пикс
ur: پکسل

source: Common Sizes
ar: الأحجام الشائعة
bn: সাধারণ আকার
hi: सामान्य आकार
ru: Стандартные размеры
ur: عام سائز

source: Mode
ar: الوضع
bn: মোড
hi: मोड
ru: Режим
ur: موڈ

source: Fit (Longest Edge)
ar: ملاءمة (الحافة الأطول)
bn: ফিট (দীর্ঘতম প্রান্ত)
hi: फिट (सबसे लंबा किनारा)
ru: По длинной стороне
ur: فٹ (لمبا کنارہ)

source: Width
ar: العرض
bn: প্রস্থ
hi: चौड़ाई
ru: По ширине
ur: چوڑائی

source: Height
ar: الارتفاع
bn: উচ্চতা
hi: ऊँचाई
ru: По высоте
ur: اونچائی

source: Shrink images to a specific size before compressing. Great for web or thumbnails.
ar: تقليص الصور لحجم محدد قبل الضغط. رائع للويب أو المصغرات.
bn: কম্প্রেস করার আগে ছবিগুলোকে নির্দিষ্ট আকারে ছোট করুন। ওয়েব বা থাম্বনেইলের জন্য দারুণ।
hi: कंप्रेस करने से पहले छवियों को एक विशिष्ट आकार में सिकोड़ें। वेब या थंबनेल के लिए बढ़िया।
ru: Уменьшает изображения до нужного размера перед сжатием. Отлично подходит для веба или миниатюр.
ur: کمپریس کرنے سے پہلے تصویروں کو ایک مخصوص سائز تک چھوٹا کریں۔ ویب یا تھمب نیلز کے لیے بہترین۔

source: Choose a standard size or enter a custom value.
ar: اختر حجماً قياسياً أو أدخل قيمة مخصصة.
bn: একটি সাধারণ আকার বেছে নিন বা একটি কাস্টম মান লিখুন।
hi: एक मानक आकार चुनें या एक कस्टम मान दर्ज करें।
ru: Выберите стандартный размер или введите свое значение.
ur: ایک معیاری سائز منتخب کریں یا اپنی مرضی کی قیمت درج کریں۔

source: 'Fit' keeps the aspect ratio within the box. 'Width'/'Height' enforce that dimension.
ru: «По стороне» сохраняет пропорции. «Ширина»/«Высота» задают конкретный размер.

source: WORKFLOW
ar: سير العمل
bn: ওয়ার্কফ্লো
hi: वर्कफ़्लो
ru: ПРОЦЕСС
ur: ورک فلو

source: Direct Save
ar: حفظ مباشر
bn: সরাসরি সেভ
hi: सीधा सहेजें
ru: Прямое сохранение
ur: براہ راست محفوظ کریں

source: Keep Metadata
ar: الاحتفاظ بالبيانات الوصفية
bn: মেটাডেটা রাখুন
hi: मेटाडेटा रखें
ru: Сохранять метаданные
ur: میٹا ڈیٹا رکھیں

source: Convert to sRGB
ar: تحويل إلى sRGB
bn: sRGB-তে রূপান্তর
hi: sRGB में बदलें
ru: Конвертировать в sRGB
ur: sRGB میں تبدیل کریں

source: Start compressing files immediately after dropping them. Disable to review list first.
ar: بدء ضغط الملفات فور سحبها. عطل هذا لمراجعة القائمة أولاً.
bn: ফাইলগুলো ছাড়ার পরেই কম্প্রেস করা শুরু করুন। আগে তালিকাটি যাচাই করতে এটি নিষ্ক্রিয় করুন।
hi: फ़ाइलों को छोड़ने के तुरंत बाद उन्हें कंप्रेस करना शुरू करें। पहले सूची की समीक्षा करने के लिए अक्षम करें।
ru: Начинать сжатие сразу после добавления файлов. Выключите, чтобы сначала проверить список.
ur: فائلیں چھوڑنے کے فوراً بعد کمپریس کرنا شروع کریں۔ پہلے فہرست کا جائزہ لینے کے لیے اسے غیر فعال کریں۔

source: Preserve EXIF, GPS, and creation dates. Increases file size slightly. Turn off for maximum privacy/saving.
ar: الحفاظ على EXIF و GPS وتواريخ الإنشاء. يزيد الحجم قليلاً. أوقفه لأقصى خصوصية/توفير.
bn: EXIF, GPS এবং তৈরির তারিখ সংরক্ষণ করুন। ফাইলের আকার কিছুটা বৃদ্ধি করে। সর্বোচ্চ গোপনীয়তা/সঞ্চয়ের জন্য এটি বন্ধ করুন।
hi: EXIF, GPS और निर्माण तिथियों को सुरक्षित रखें। फ़ाइल का आकार थोड़ा बढ़ाता है। अधिकतम गोपनीयता/बचत के लिए बंद करें।
ru: Сохраняет EXIF, GPS и дату создания. Немного увеличивает размер. Выключите для максимальной приватности и экономии.
ur: EXIF، GPS اور تخلیق کی تاریخیں محفوظ رکھیں۔ فائل کا سائز تھوڑا بڑھاتا ہے۔ زیادہ سے زیادہ رازداری/بچت کے لیے اسے بند کریں۔

source: Standardizes color profile for maximum web compatibility. Fixes 'washed out' colors in some browsers.
ar: يوحد نمط الألوان لأقصى توافق مع الويب. يصلح الألوان 'الباهتة' في بعض المتصفحات.
bn: সর্বোচ্চ ওয়েব সামঞ্জস্যের জন্য রঙ প্রোফাইল মানসম্মত করে। কিছু ব্রাউজারে 'ফ্যাকাশে' রঙ ঠিক করে।
hi: अधिकतम वेब संगतता के लिए रंग प्रोफ़ाइल को मानकीकृत करता है। कुछ ब्राउज़रों में 'धुले हुए' रंगों को ठीक करता है।
ru: Стандартизирует профиль для веб-совместимости. Исправляет «выцветшие» цвета в некоторых браузерах.
ur: زیادہ سے زیادہ ویب مطابقت کے لیے کلر پروفائل کو معیاری بناتا ہے۔ کچھ براؤزرز میں 'دھندلے' رنگوں کو ٹھیک کرتا ہے۔

source: OUTPUT
ar: المخرجات
bn: আউটপুট
hi: आउटपुट
ru: ВЫХОД
ur: آؤٹ پٹ

source: Where files go: 'Suffix' adds _min to name (safest). 'Separate Folder' keeps them organized. 'Overwrite' replaces originals (Dangerous!).
ar: أين تذهب الملفات: 'Suffix' يضيف _min للاسم (الأكثر أماناً). 'Separate Folder' يحافظ عليها منظمة. 'Overwrite' يستبدل الأصول (خطر!).
bn: ফাইলগুলো কোথায় যায়: 'Suffix' নামের সাথে _min যোগ করে (সবচেয়ে নিরাপদ)। 'Separate Folder' সেগুলোকে গুছিয়ে রাখে। 'Overwrite' আসল ফাইলগুলোকে বদলে দেয় (বিপজ্জনক!)।
hi: फ़ाइलें कहाँ जाती हैं: 'प्रत्यय' नाम में _min जोड़ता है (सबसे सुरक्षित)। 'अलग फ़ोल्डर' उन्हें व्यवस्थित रखता है। 'ओवरराइट' मूल को बदल देता है (खतरनाक!)।
ru: Куда сохранять: «Суффикс» добавляет _min (безопасно). «Отдельная папка» — для порядка. «Перезаписать» — заменяет оригинал (Опасно!).
ur: فائلیں کہاں جاتی ہیں: 'لاحقہ' نام میں _min شامل کرتا ہے (سب سے محفوظ)۔ 'الگ فولڈر' انہیں منظم رکھتا ہے۔ 'اوور رائٹ' اصل فائل کو تبدیل کر دیتا ہے (خطرناک!)۔

source: Warning: Original files will be replaced and cannot be recovered.
ar: تحذير: سيتم استبدال الملفات الأصلية ولا يمكن استعادتها.
bn: সতর্কবার্তা: আসল ফাইলগুলো বদলে যাবে এবং পুনরুদ্ধার করা যাবে না।
hi: चेतावनी: मूल फ़ाइलों को बदल दिया जाएगा और उन्हें पुनर्प्राप्त नहीं किया जा सकता है।
ru: Внимание: Оригинальные файлы будут заменены и не смогут быть восстановлены.
ur: انتباہ: اصل فائلیں تبدیل کر دی جائیں گی اور انہیں واپس نہیں لایا جا سکتا۔

source: Drag files here to start batch
ar: اسحب الملفات هنا لبدء المجموعة
bn: ব্যাচ শুরু করতে ফাইলগুলো এখানে টানুন
hi: बैच शुरू करने के लिए फ़ाइलों को यहाँ खींचें
ru: Перетащите файлы сюда для начала
ur: بیچ شروع کرنے کے لیے فائلیں یہاں کھینچیں

source: Supports nested folders
ar: يدعم المجلدات المتداخلة
bn: নেস্টেড ফোল্ডার সমর্থন করে
hi: नेस्टेड फ़ोल्डरों का समर्थन करता है
ru: Поддерживается вложенность папок
ur: نیستڈ فولڈرز کو سپورٹ کرتا ہے

source: Toggle Theme
ar: تبديل السمة
bn: থিম পরিবর্তন করুন
hi: थीम टॉगल करें
ru: Сменить тему
ur: تھیم تبدیل کریں

source: Start
ar: ابدأ
bn: শুরু
hi: शुरू करें
ru: Старт
ur: شروع کریں

source: Optimizing...
ar: جاري التحسين...
bn: অপ্টিমাইজ হচ্ছে...
hi: ऑप्टिमाइज़ हो रहा है...
ru: Оптимизация...
ur: آپٹیمائز ہو رہا ہے...

source: Done with Errors
ar: تم مع وجود أخطاء
bn: ত্রুটিসহ সম্পন্ন
hi: त्रुटियों के साथ समाप्त
ru: Завершено с ошибками
ur: غلطیوں کے ساتھ مکمل

source: Complete!
ar: اكتمل!
bn: সম্পন্ন!
hi: पूरा हुआ!
ru: Готово!
ur: مکمل ہوا!

source: File
ar: ملف
bn: ফাইল
hi: फ़ाइल
ru: Файл
ur: فائل

source: Original
ar: الأصلي
bn: আসল
hi: मूल
ru: Оригинал
ur: اصل

source: Optimized
ar: المحسن
bn: অপ্টিমাইজ করা
hi: ऑप्टिमाइज़ किया गया
ru: Сжатый
ur: آپٹیمائز شدہ

source: Savings
ar: التوفير
bn: সাশ্রয়
hi: बचत
ru: Экономия
ur: بچت

source: Status
ar: الحالة
bn: অবস্থা
hi: स्थिति
ru: Статус
ur: صورتحال

source: Clear List
ar: مسح القائمة
bn: তালিকা পরিষ্কার করুন
hi: सूची साफ़ करें
ru: Очистить список
ur: فہرست صاف کریں

source: Saved
ar: تم توفيره
bn: সাশ্রয় হয়েছে
hi: सहेजा गया
ru: Сэкономлено
ur: محفوظ کیا گیا

source: Pending
ar: قيد الانتظار
bn: অপেক্ষমাণ
hi: लंबित
ru: В очереди
ur: زیر التواء

source: Processing
ar: جاري المعالجة
bn: প্রক্রিয়াকরণ
hi: प्रोसेसिंग
ru: Обработка
ur: پروسیسنگ

source: Done
ar: تم
bn: সম্পন্ন
hi: हो गया
ru: Готово
ur: ہو گیا

source: Error
ar: خطأ
bn: ত্রুটি
hi: त्रुटि
ru: Ошибка
ur: غلطی

source: Skipped
ar: تم التخطي
bn: এড়িয়ে যাওয়া হয়েছে
hi: छोड़ दिया गया
ru: Пропущено
ur: چھوڑ دیا گیا

source: Skip
ar: تخطي
bn: এড়িয়ে যান
hi: छोड़ें
ru: Пропуск
ur: چھوڑیں

source: %d Files processed successfully
ar: تمت معالجة %d ملفات بنجاح
bn: %d টি ফাইল সফলভাবে সম্পন্ন হয়েছে
hi: %d फ़ाइलें सफलतापूर्वक संसाधित हुईं
ru: Файлов успешно обработано: %d
ur: %d فائلیں کامیابی سے پراسیس ہوئیں

source: Real-time compression metrics
ar: مقاييس الضغط في الوقت الفعلي
bn: রিয়েল-টাইম কমপ্রেশন মেট্রিক্স
hi: रीयल-टाइम संपीड़न मेट्रिक्स
ru: Метрики сжатия в реальном времени
ur: ریئل ٹائم کمپریشن میٹرکس

source: CURRENT SESSION
ar: الجلسة الحالية
bn: বর্তমান সেশন
hi: वर्तमान सत्र
ru: ТЕКУЩАЯ СЕССИЯ
ur: موجودہ سیشن

source: Session Files
ar: ملفات الجلسة
bn: সেশন ফাইল সংখ্যা
hi: सत्र फ़ाइलें
ru: Файлы сессии
ur: سیشن فائلیں

source: Session Saved
ar: الموفر في الجلسة
bn: সেশন সাশ্রয়
hi: सत्र सहेजा गया
ru: Сэкономлено (сессия)
ur: سیشن کی بچت

source: LIFETIME TOTALS
ar: الإجمالي العام
bn: সর্বমোট
hi: जीवनकाल कुल
ru: ИТОГИ ЗА ВСЁ ВРЕМЯ
ur: مجموعی طور پر

source: Total Files
ar: إجمالي الملفات
bn: মোট ফাইল সংখ্যা
hi: कुल फ़ाइलें
ru: Всего файлов
ur: کل فائلیں

source: Total Saved
ar: إجمالي التوفير
bn: মোট সাশ্রয়
hi: कुल सहेजा गया
ru: Всего сэкономлено
ur: کل بچت

source: TOTAL SPACE SAVED
ru: ВСЕГО СЭКОНОМЛЕНО МЕСТА

source: AVERAGE REDUCTION
ru: СРЕДНЕЕ СЖАТИЕ

source: in last session
ru: за посл. сессию

source: TOTAL FILES PROCESSED: %d
ru: ВСЕГО ОБРАБОТАНО ФАЙЛОВ: %d

source: SAVINGS BY FORMAT
ru: ЭКОНОМИЯ ПО ФОРМАТАМ

source: OTHER
ru: ПРОЧЕЕ

source: Statistics Disabled
ru: Статистика отключена

source: Enable statistics in settings to track your savings.
ru: Включите статистику в настройках, чтобы отслеживать результаты.

source: Session and lifetime performance metrics
ru: Метрики за сессию и все время

source: Disable statistics
ru: Не считать статистику

source: When disabled, compression data is not saved.
ru: Если отключено, данные о сжатии не сохраняются.
